* Dchan [6/8]                                                         :dchan:
** DONE Plan9 Research and Proof of Concept
   :LOGBOOK:
   CLOCK: [2016-01-11 Mon 15:00]--[2016-02-03 Tue 15:00] => 552:00
   :END:

** DONE Design of API

** DONE Add travis-ci integration
   SCHEDULED: <2016-03-04 Fri> DEADLINE: <2016-03-07 Mon>
   :LOGBOOK:
   CLOCK: [2016-03-07 Mon 12:35]--[2016-03-07 Mon 13:00] =>  0:25
   CLOCK: [2016-03-04 Fri 09:05]--[2016-03-04 Fri 19:00] =>  9:55
   :END:

** DONE Make possible download the last version of book
   :LOGBOOK:
   CLOCK: [2016-03-09 Wed 16:30]--[2016-03-09 Wed 16:38] =>  0:08
   CLOCK: [2016-03-09 Wed 15:44]--[2016-03-09 Wed 16:23] =>  0:39
   CLOCK: [2016-03-09 Wed 14:53]--[2016-03-09 Wed 15:35] =>  0:42
   CLOCK: [2016-03-09 Wed 14:45]--[2016-03-09 Wed 14:49] =>  0:04
   CLOCK: [2016-03-09 Wed 12:54]--[2016-03-09 Wed 14:34] =>  1:40
   :END:

** DONE Publish HTML version of master branch
** DONE Design of dchan-proxy
   :LOGBOOK:
   CLOCK: [2016-02-29 Mon 09:15]--[2016-02-29 Mon 18:31] =>  9:16
   :END:

** Dchan-proxy [0/2]                                                  :proxy:
*** WAITING Implement dchan-proxy PoC [5/7]
    SCHEDULED: <2016-03-08 Tue> DEADLINE: <2016-03-18 Fri>
    :PROPERTIES:
    :ORDERED:  t
    :END:
    - State "WAITING"    from "DONE"       [2016-04-05 Tue 12:06] \\
      Task blocked. Requires research!
**** DONE Create the basic 9P file server
     :LOGBOOK:
     CLOCK: [2016-03-03 Thu 14:01]--[2016-03-03 Thu 18:12] =>  4:11
     CLOCK: [2016-03-03 Thu 09:10]--[2016-03-03 Thu 12:02] =>  2:52
     :END:
**** DONE Add testing infrastructure
     :LOGBOOK:
     CLOCK: [2016-03-07 Mon 13:05]--[2016-03-07 Mon 18:00] =>  4:55
     :END:
**** DONE Test usage of unix socket as transport protocol
     :LOGBOOK:
     CLOCK: [2016-03-08 Tue 10:31]--[2016-03-08 Tue 12:00] =>  1:29
     :END:
**** DONE Separate testing infrastructure in a sub-module. [[https://github.com/NeowayLabs/dchan/issues/10][#10]]
     :LOGBOOK:
     CLOCK: [2016-03-08 Tue 12:20]--[2016-03-08 Tue 14:19] =>  1:59
     :END:
**** DONE Study the Go API for 9P clients (for proxying requests)
     :LOGBOOK:
     CLOCK: [2016-03-08 Tue 15:21]--[2016-03-08 Tue 16:33] =>  1:12
     :END:
**** WAITING Implement the proxy as a pure TCP-proxy
     - State "WAITING" from "DONE" [2016-03-15 Tue 14:18] \\
       The current proxy design have flaws discovered in the test
       cases. It'll require more research.
     :LOGBOOK:
     CLOCK: [2016-03-09 Wed 10:10]--[2016-03-09 Wed 12:52] =>  2:42
     CLOCK: [2016-03-08 Tue 17:00]--[2016-03-08 Tue 19:16] =>  2:16
     CLOCK: [2016-03-08 Tue 16:36]--[2016-03-08 Tue 16:53] =>  0:17
     :END:
**** TODO Achieve good test coverage
     :LOGBOOK:
     CLOCK: [2016-03-11 Fri 15:25]--[2016-03-11 Fri 16:54] =>  1:29
     CLOCK: [2016-03-11 Fri 13:16]--[2016-03-11 Fri 14:50] =>  1:34
     CLOCK: [2016-03-11 Fri 11:23]--[2016-03-11 Fri 12:54] =>  1:31
     CLOCK: [2016-03-11 Fri 10:08]--[2016-03-11 Fri 11:17] =>  1:09
     CLOCK: [2016-03-10 Thu 17:55]--[2016-03-10 Thu 18:59] =>  1:04
     CLOCK: [2016-03-10 Thu 16:43]--[2016-03-10 Thu 17:46] =>  1:03
     CLOCK: [2016-03-10 Thu 15:26]--[2016-03-10 Thu 16:43] =>  1:17
     CLOCK: [2016-03-10 Thu 14:22]--[2016-03-10 Thu 15:22] =>  1:00
     CLOCK: [2016-03-10 Thu 13:35]--[2016-03-10 Thu 13:57] =>  0:22
     CLOCK: [2016-03-10 Thu 12:52]--[2016-03-10 Thu 13:33] =>  0:41
     CLOCK: [2016-03-10 Thu 12:46]--[2016-03-10 Thu 12:49] =>  0:03
     CLOCK: [2016-03-10 Thu 09:11]--[2016-03-10 Thu 12:43] =>  3:32
     :END:

*** TODO Create intensive tests simulating network problems
    SCHEDULED: <2016-03-21 Mon>

** Dchan-server [4/6]                                                :server:
*** DONE Add basic unit tests to ob-go
     :LOGBOOK:
     CLOCK: [2016-03-15 Tue 15:48]--[2016-03-17 Thu 17:59] => 50:11
     :END:
*** DONE Beautify go code generated by org-tangle (ob-go)
     :LOGBOOK:
     CLOCK: [2016-03-17 Thu 18:10]--[2016-03-17 Thu 19:00] =>  0:50
     :END:
*** DONE Fix ob-go bug (issue #1)
     :LOGBOOK:
     CLOCK: [2016-03-17 Thu 19:30]--[2016-03-17 Thu 20:03] =>  0:33
     :END:
*** DONE PoC for distribute over p2p networks
     :LOGBOOK:
     CLOCK: [2016-03-24 Thu 09:21]--[2016-03-24 Thu 18:50] =>  9:29
     CLOCK: [2016-03-25 Fri 08:02]--[2016-03-25 Fri 22:12] => 14:10
     CLOCK: [2016-03-28 Mon 13:10]--[2016-03-28 Mon 17:00] =>  3:50
     :END:
*** WAITING Add FUSE_INTERRUPT support for 9pfuse [[https://github.com/9fans/plan9port/issues/56][p9p issue 56]]
     - State "WAITING"    from "DONE"       [2016-04-05 Tue 10:01] \\
       I'd spent so much time on this that I'm not sure it still worth the
       time,
     :LOGBOOK:
     CLOCK: [2016-04-04 Mon 08:00]--[2016-04-04 Tue 17:01] =>  9:01
     :END:

     Partial implementation: [[https://github.com/tiago4orion/plan9port/tree/9pfuse-interrupt][p9p fork (branch 9pfuse-interrupt)]]

*** TODO Create the basic Go 9P file server.
     :LOGBOOK:
     CLOCK: [2016-03-29 Tue 13:25]--[2016-03-29 Tue 16:30] =>  3:05
     CLOCK: [2016-03-17 Thu 17:50]--[2016-03-17 Thu 17:59] =>  0:09
     CLOCK: [2016-03-17 Thu 9:12]--[2016-03-17 Thu 17:43] =>  8:31
     CLOCK: [2016-03-15 Tue 15:00]--[2016-03-15 Tue 15:46] =>  0:46
     :END:


** TODO Port part of our architecture to use dchan

** TODO Add some instrumentation to compare against RabbitMQ

** Generate comparison tables [0/2]

*** TODO Benchmark tables
*** TODO LoC on client side (dchan vs amqp)

#+BEGIN: clocktable :maxlevel 4 :scope file
#+CAPTION: Clock summary at [2016-04-05 Tue 12:24]
| Headline                                         | Time        |          |          |       |
|--------------------------------------------------+-------------+----------+----------+-------|
| *Total time*                                     | *29d 16:02* |          |          |       |
|--------------------------------------------------+-------------+----------+----------+-------|
| Dchan [6/8]                                      | 29d 16:02   |          |          |       |
| \_  DONE Plan9 Research and Proof of Concept     |             | 23d 0:00 |          |       |
| \_  DONE Add travis-ci integration               |             |    10:20 |          |       |
| \_  DONE Make possible download the last...      |             |     3:13 |          |       |
| \_  DONE Design of dchan-proxy                   |             |     9:16 |          |       |
| \_  Dchan-proxy [0/2]                            |             | 1d 12:38 |          |       |
| \_    WAITING Implement dchan-proxy PoC [5/7]    |             |          | 1d 12:38 |       |
| \_      DONE Create the basic 9P file server     |             |          |          |  7:03 |
| \_      DONE Add testing infrastructure          |             |          |          |  4:55 |
| \_      DONE Test usage of unix socket as...     |             |          |          |  1:29 |
| \_      DONE Separate testing infrastructure...  |             |          |          |  1:59 |
| \_      DONE Study the Go API for 9P clients...  |             |          |          |  1:12 |
| \_      WAITING Implement the proxy as a pure... |             |          |          |  5:15 |
| \_      TODO Achieve good test coverage          |             |          |          | 14:45 |
| \_  Dchan-server [4/6]                           |             |  4d 4:35 |          |       |
| \_    DONE Add basic unit tests to ob-go         |             |          |  2d 2:11 |       |
| \_    DONE Beautify go code generated by...      |             |          |     0:50 |       |
| \_    DONE Fix ob-go bug (issue #1)              |             |          |     0:33 |       |
| \_    DONE PoC for distribute over p2p...        |             |          |  1d 3:29 |       |
| \_    WAITING Add FUSE_INTERRUPT support...      |             |          |     9:01 |       |
| \_    TODO Create the basic Go 9P file server.   |             |          |    12:31 |       |
#+END:
